import cv2
import colorama

while True:

 colorama.init()

 print(colorama.Fore.BLACK)
 print(colorama.Back.LIGHTWHITE_EX)

 print("""               Привіт!
          Про що поговоримо?""")

 user_input = input('Я:')

 if user_input == 'мені сумно':
  print('Не сумуй, все добре, просто заспокойся😉')

 else:

  if user_input == 'пока':
   print('Пока!')

  else:

   if user_input == 'привіт':
    print('Привіт! З чим допомогти?')

   else:

    if user_input == 'напиши табличку множення':
     print("""Таблиця множення
    2*1=2
    2*2=4
    2*3=6
    2*4=8
    2*5=10
    2*6=12
    2*7=14
    2*8=16
    2*9=18
    2*10=20
    
    3*1=3
    3*2=6
    3*3=9
    3*4=12
    3*5=15
    3*6=18
    3*7=21
    3*8=24
    3*9=27
    3*10=30
    
    4*1=4
    4*2=8
    4*3=12
    4*4=16
    4*5=20
    4*6=24
    4*7=28
    4*8=32
    4*9=36
    4*10=40
    
    5*1=5
    5*2=10
    5*3=15
    5*4=20
    5*5=25
    5*6=30
    5*7=35
    5*8=40
    5*9=45
    5*10=50
    
    6*1=6
    6*2=12
    6*3=18
    6*4=24
    6*5=30
    6*6=36
    6*7=42
    6*8=48
    6*9=54
    6*10=60
    
    7*1=7
    7*2=14
    7*3=21
    7*4=28
    7*5=35
    7*6=42
    7*7=49
    7*8=56
    7*9=63
    7*10=70
    
    8*1=8
    8*2=16
    8*3=24
    8*4=32
    8*5=40
    8*6=48
    8*7=56
    8*8=64
    8*9=72
    8*10=80
    
    9*1=9
    9*2=18
    9*3=27
    9*4=36
    9*5=45
    9*6=54
    9*7=63
    9*8=72
    9*9=81
    9*10=90
    """)

    else:

     if user_input == 'покажи змію':

      snake_img_path = 'thumb-article-420x300-tyc8.jpg'

      img = cv2.imread(snake_img_path)

      print(snake_img_path)
  print('Ось змія.')

  cv2.imshow('Snake', img)
  cv2.waitKey()

  break